Revit 2027 API
StairsRunType.TreadProfile Property
 The id of the profile of the treads.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TreadProfile { get; set; }
Public Property TreadProfile As ElementId
	Get
	Set
public:
property ElementId^ TreadProfile {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TreadProfile : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The profile is neither a valid element id nor invalidElementId. -or- When setting this property: The profile is not a valid tread profile symbol.
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property: The run type has no tread so the data being set is not applicable.
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace